ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28004x_dcsm_bank0_z1_otp_regs.xml
<module id="DCSM_BANK0_Z1_OTP" HW_revision="" description="DCSM BANK0 Z1 OTP Registers">
	<register id="B0_Z1OTP_LINKPOINTER1" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer1 in Z1 OTP for flash BANK0">
		<bitfield id="B0_Z1OTP_LINKPOINTER1" description="Zone1 Link Pointer 1 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B0_Z1OTP_LINKPOINTER2" width="32" page="1" offset="0x4" internal="0" description="Zone 1 Link Pointer2 in Z1 OTP for flash BANK0">
		<bitfield id="B0_Z1OTP_LINKPOINTER2" description="Zone1 Link Pointer 2 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B0_Z1OTP_LINKPOINTER3" width="32" page="1" offset="0x8" internal="0" description="Zone 1 Link Pointer3 in Z1 OTP for flash BANK0">
		<bitfield id="B0_Z1OTP_LINKPOINTER3" description="Zone1 Link Pointer 3 location in USER OTP of Flash BANK0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_BOOTPIN_CONFIG" width="32" page="1" offset="0xc" internal="0" description="Boot Pin Configuration">
		<bitfield id="Z1OTP_BOOTPIN_CONFIG" description="Zone1 Boot pin config register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_GPREG2" width="32" page="1" offset="0xe" internal="0" description="Zone-1 General Purpose Register-2 content">
		<bitfield id="Z1OTP_GPREG2" description="Zone1 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_PSWDLOCK" width="32" page="1" offset="0x10" internal="0" description="Secure Password Lock in Z1 OTP">
		<bitfield id="Z1OTP_PSWDLOCK" description="Zone1 Password lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_CRCLOCK" width="32" page="1" offset="0x14" internal="0" description="Secure CRC Lock in Z1 OTP">
		<bitfield id="Z1OTP_CRCLOCK" description="Zone1 CRC lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_JTAGLOCK" width="32" page="1" offset="0x18" internal="0" description="Secure JTAG Lock in Z1 OTP">
	</register>
	<register id="Z1OTP_BOOTDEF_LOW" width="32" page="1" offset="0x1c" internal="0" description="Boot definition (low 32bit)">
		<bitfield id="Z1OTP_BOOTDEF_LOW" description="Zone1 Boot definition register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_BOOTDEF_HIGH" width="32" page="1" offset="0x1e" internal="0" description="Boot definition (high 32bit)">
		<bitfield id="Z1OTP_BOOTDEF_HIGH" description="Zone1 Boot definition location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
